; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared2 - mode
	infrared4 - mode
	image1 - mode
	image3 - mode
	thermograph0 - mode
	spectrograph5 - mode
	image6 - mode
	GroundStation6 - direction
	GroundStation8 - direction
	Star0 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	GroundStation1 - direction
	Star9 - direction
	Star3 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 infrared4)
	(supports instrument1 image6)
	(calibration_target instrument1 GroundStation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument2 image3)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 image6)
	(supports instrument3 infrared2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph5)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 image1)
	(supports instrument5 image6)
	(calibration_target instrument5 Star9)
	(supports instrument6 spectrograph5)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation5)
)
(:goal (and
	(pointing satellite1 GroundStation7)
	(have_image Phenomenon10 image3)
	(have_image Phenomenon10 infrared2)
	(have_image Star11 image1)
	(have_image Planet12 infrared4)
	(have_image Phenomenon13 spectrograph5)
	(have_image Planet14 image6)
	(have_image Planet14 infrared4)
))

)

; plan
1. (turn_to satellite2 groundstation1 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite2 phenomenon13 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon13)
   goals met: 0 of 8
5. (take_image satellite2 phenomenon13 instrument4 spectrograph5)
   added: (have_image phenomenon13 spectrograph5)
   goals met: 1 of 8
6. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 1 of 8
7. (turn_to satellite0 groundstation7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation7)
   goals met: 1 of 8
8. (take_image satellite2 phenomenon10 instrument4 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 2 of 8
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 8
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 8
11. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 2 of 8
12. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 2 of 8
13. (calibrate satellite0 instrument1 groundstation7)
   added: (calibrated instrument1)
   goals met: 2 of 8
14. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 2 of 8
15. (turn_to satellite0 planet12 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet12)
   goals met: 2 of 8
16. (take_image satellite0 planet12 instrument1 infrared4)
   added: (have_image planet12 infrared4)
   goals met: 3 of 8
17. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 3 of 8
18. (take_image satellite0 planet14 instrument1 image6)
   added: (have_image planet14 image6)
   goals met: 4 of 8
19. (take_image satellite0 planet14 instrument1 infrared4)
   added: (have_image planet14 infrared4)
   goals met: 5 of 8
20. (turn_to satellite1 phenomenon10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon10)
   goals met: 5 of 8
21. (take_image satellite1 phenomenon10 instrument2 image3)
   added: (have_image phenomenon10 image3)
   goals met: 6 of 8
22. (turn_to satellite1 groundstation7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation7)
   goals met: 7 of 8
23. (turn_to satellite2 star9 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star9)
   goals met: 7 of 8
24. (calibrate satellite2 instrument5 star9)
   added: (calibrated instrument5)
   goals met: 7 of 8
25. (turn_to satellite2 star11 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star11)
   goals met: 7 of 8
26. (take_image satellite2 star11 instrument5 image1)
   added: (have_image star11 image1)
   goals met: 8 of 8
